bigtreetech/BIGTREETECH-OCTOPUS-V1.0/Firmware/RepRapFirmware/RRFBuild-SourceCode/CoreN2G/src/atmel/SAMC21_DFP/1.2.176/samc21/atdf/ATSAMC21E18A.atdf
        <register name="CTRLB" offset="0x2" rw="RW" size="2" initval="0x2000" caption="Control B">
          <bitfield name="PRESCALER" caption="Prescaler Configuration" mask="0xFF" values="SDADC_CTRLB__PRESCALER"/>
          <bitfield name="OSR" caption="Over Sampling Ratio" mask="0x700" values="SDADC_CTRLB__OSR"/>
          <bitfield name="SKPCNT" caption="Skip Sample Count" mask="0xF000"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="1" initval="0x00" caption="Event Control">
          <bitfield name="FLUSHEI" caption="Flush Event Input Enable" mask="0x1"/>
          <bitfield name="STARTEI" caption="Start Conversion Event Input Enable" mask="0x2"/>
          <bitfield name="FLUSHINV" caption="Flush Event Invert Enable" mask="0x4"/>
          <bitfield name="STARTINV" caption="Satrt Event Invert Enable" mask="0x8"/>
          <bitfield name="RESRDYEO" caption="Result Ready Event Out" mask="0x10"/>
          <bitfield name="WINMONEO" caption="Window Monitor Event Out" mask="0x20"/>
        </register>
        <register name="INTENCLR" offset="0x5" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt Enable Clear">
          <bitfield name="RESRDY" caption="Result Ready Interrupt Disable" mask="0x1"/>
          <bitfield name="OVERRUN" caption="Overrun Interrupt Disable" mask="0x2"/>
          <bitfield name="WINMON" caption="Window Monitor Interrupt Disable" mask="0x4"/>
        </register>
        <register name="INTENSET" offset="0x6" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt Enable Set">
          <bitfield name="RESRDY" caption="Result Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OVERRUN" caption="Overrun Interrupt Enable" mask="0x2"/>
          <bitfield name="WINMON" caption="Window Monitor Interrupt Enable" mask="0x4"/>
        </register>
        <register name="INTFLAG" offset="0x7" rw="RW" size="1" atomic-op="clear:INTFLAG" initval="0x00" caption="Interrupt Flag Status and Clear">
          <bitfield name="RESRDY" caption="Result Ready Interrupt Flag" mask="0x1"/>
          <bitfield name="OVERRUN" caption="Overrun Interrupt Flag" mask="0x2"/>
          <bitfield name="WINMON" caption="Window Monitor Interrupt Flag" mask="0x4"/>
        </register>
        <register name="SEQSTATUS" offset="0x8" rw="R" size="1" initval="0x00" caption="Sequence Status">
          <bitfield name="SEQSTATE" caption="Sequence State" mask="0xF"/>
          <bitfield name="SEQBUSY" caption="Sequence Busy" mask="0x80"/>
        </register>
        <register name="INPUTCTRL" offset="0x9" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Input Control">
          <bitfield name="MUXSEL" caption="SDADC Input Selection" mask="0xF" values="SDADC_INPUTCTRL__MUXSEL"/>
        </register>
        <register name="CTRLC" offset="0xA" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Control C">
          <bitfield name="FREERUN" caption="Free Running Mode" mask="0x1"/>
        </register>
        <register name="WINCTRL" offset="0xB" rw="RW" size="1" initval="0x00" caption="Window Monitor Control">
          <bitfield name="WINMODE" caption="Window Monitor Mode" mask="0x7"/>
        </register>
        <register name="WINLT" offset="0xC" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Window Monitor Lower Threshold">
          <bitfield name="WINLT" caption="Window Lower Threshold" mask="0xFFFFFF"/>
        </register>
        <register name="WINUT" offset="0x10" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Window Monitor Upper Threshold">
          <bitfield name="WINUT" caption="Window Upper Threshold" mask="0xFFFFFF"/>
        </register>
        <register name="OFFSETCORR" offset="0x14" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Offset Correction">
          <bitfield name="OFFSETCORR" caption="Offset Correction Value" mask="0xFFFFFF"/>
        </register>
        <register name="GAINCORR" offset="0x18" rw="RW" access="WSYNC" size="2" initval="0x0001" caption="Gain Correction">
          <bitfield name="GAINCORR" caption="Gain Correction Value" mask="0x3FFF"/>
        </register>
        <register name="SHIFTCORR" offset="0x1A" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Shift Correction">
          <bitfield name="SHIFTCORR" caption="Shift Correction Value" mask="0xF"/>
        </register>
        <register name="SWTRIG" offset="0x1C" rw="RW" access="WSYNC" size="1" initval="0x00" caption="Software Trigger">
          <bitfield name="FLUSH" caption="SDADC Flush" mask="0x1"/>
          <bitfield name="START" caption="Start SDADC Conversion" mask="0x2"/>
        </register>
        <register name="SYNCBUSY" offset="0x20" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="SWRST Synchronization Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="ENABLE Synchronization Busy" mask="0x2"/>
          <bitfield name="CTRLC" caption="CTRLC Synchronization Busy" mask="0x4"/>
          <bitfield name="INPUTCTRL" caption="INPUTCTRL Synchronization Busy" mask="0x8"/>
          <bitfield name="WINCTRL" caption="WINCTRL Synchronization Busy" mask="0x10"/>
          <bitfield name="WINLT" caption="WINLT Synchronization Busy" mask="0x20"/>
          <bitfield name="WINUT" caption="WINUT Synchronization Busy" mask="0x40"/>
          <bitfield name="OFFSETCORR" caption="OFFSETCTRL Synchronization Busy" mask="0x80"/>
          <bitfield name="GAINCORR" caption="GAINCORR Synchronization Busy" mask="0x100"/>
          <bitfield name="SHIFTCORR" caption="SHIFTCORR Synchronization Busy" mask="0x200"/>
          <bitfield name="SWTRIG" caption="SWTRG Synchronization Busy" mask="0x400"/>
          <bitfield name="ANACTRL" caption="ANACTRL Synchronization Busy" mask="0x800"/>
        </register>
        <register name="RESULT" offset="0x24" rw="R" size="4" initval="0x00000000" caption="Result">
          <bitfield name="RESULT" caption="Result Value" mask="0xFFFFFF"/>
          <bitfield name="RESERVED" caption="Reserved" mask="0xFF000000"/>
        </register>
